ab_nginx
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.4.6
Server Hostname:        localhost
Server Port:            80

Document Path:          /sample.html
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   0.262 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      261000 bytes
HTML transferred:       0 bytes
Requests per second:    3818.73 [#/sec] (mean)
Time per request:       0.262 [ms] (mean)
Time per request:       0.262 [ms] (mean, across all concurrent requests)
Transfer rate:          973.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     0    0   0.1      0       2
Waiting:        0    0   0.1      0       2
Total:          0    0   0.1      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%      2 (longest request)